src/cf/InformationRegisters/уатСтатусыГрузов_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСтатусыГрузов_уэ</Name>
			<Comment>Статусы грузов (уэ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатЭтапыМультимодальныхПеревозок_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатЭтапыМультимодальныхПеревозок_уэ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>xПунктаНазначения</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>xПунктаОтправления</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>yПунктаНазначения</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>yПунктаОтправления</Name>
					<Comment>Используется для отображения на схеме перевозок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСПеревозчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФормированияКомплектовДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНастройкиКомплектовДокументов_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьАктОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьАктПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьИзвлечениеГрузовИзКонтейнера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьМаршрутныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьРазмещениеГрузовВКонтейнере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтНачалаОтправление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтНачалаНазначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатТипыСобытийДляУведомления_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыСобытийДляУведомления_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаИзМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакреплениеМаршрутногоЛистаЗаПеревозчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВесообъемныхХарактеристик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПунктовМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаГрузовогоМеста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОтветаПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаПолучения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаРодительскогоЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибытиеВПунктПланИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибытиеВПунктФактИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрогнозОпозданияПоМаршрутномуЛисту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасхожденияПоСкладскомуАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбытиеИзПунктаПланИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбытиеИзПунктаФактИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПеревозчикуПоСопроводительнымДокументам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеПеревозчиковНаМаршрутныеЛисты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВодителемСледующегоПункта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатПравилаФормированияУведомлений_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПравилаФормированияУведомлений_уэ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСпособыВзаимодействий_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеВажность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеПроверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыОбъектовДляУведомлений_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыСобытийДляУведомления_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомплектовДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНастройкиКомплектовДокументов_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбластиПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбластиПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВидыОбластейПримененияПравил_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОбластиПрименения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
								<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
								<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТипыПунктов</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:EnumRef.уатВидыДоставки_уэ</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТипыСобытий_уэ</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПолучателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыПолучателейУведомлений_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатСтатусыГрузов_уэ/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	Исключение
		Регистратор = Неопределено;
	КонецПопытки;
	
	Если НЕ Отказ 
		И НЕ ТипЗнч(Регистратор) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
		
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			
			Если ТекЗапись.Статус = Справочники.уатСтатусы_уэ.Отклонен Тогда
				ТекДок = ТекЗапись.Заказ.ПолучитьОбъект();
				
				ТекстОшибкиЗаписи = "";
				
				Попытка 
					ТекДок.ДополнительныеСвойства.Вставить("НеФормироватьДвиженийПоУслугам", Истина);
					ТекДок.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстОшибкиЗаписи = ОписаниеОшибки();
				КонецПопытки;
			ИначеЕсли ТекЗапись.Статус = Справочники.уатСтатусы_уэ.Закрыт Тогда
				ТекДок = ТекЗапись.Заказ.ПолучитьОбъект();
				ТекДок.ДатаЗакрытия = ТекЗапись.Период;
				
				Попытка 
					ТекДок.Записать();
				Исключение
					ТекстОшибкиЗаписи = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

	Если Не Отказ И ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ") Тогда
	
		Если ЭтотОбъект.Количество() > 0 И ДополнительныеСвойства.Свойство("ПредыдущиеЗаписи") Тогда
			// Создание новых записей регистра после удаления старых.
			СформироватьУведомленияПоТекущимЗаписям(ДополнительныеСвойства.ПредыдущиеЗаписи);
		ИначеЕсли ЭтотОбъект.Количество() > 0 Тогда
			// Создание новых записей регистра без удаления старых.
			ПредыдущиеЗаписи = ЭтотОбъект.ВыгрузитьКолонки("Заказ, ГрузовоеМесто, Статус, Период");
			СформироватьУведомленияПоТекущимЗаписям(ПредыдущиеЗаписи);
		ИначеЕсли ЭтотОбъект.Количество() = 0 Тогда
			// Удаление записей регистра.
			// Запоминаются старые значения записей регистра перед их удалением.
			ЭтотОбъект.Прочитать();
			ТаблицаСтатусов = ЭтотОбъект.Выгрузить(,"Заказ, ГрузовоеМесто, Статус, Период");
			ЭтотОбъект.Очистить();
			
			ДополнительныеСвойства.Вставить("ПредыдущиеЗаписи", ТаблицаСтатусов);
			
		КонецЕсли;
	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	// Уведомления
	Если Не Отказ И ДополнительныеСвойства.Свойство("НовыеЗаписи") Тогда
		
		// Проверка наличия правил формирования уведомлений по событию "Изменение статуса родительского заказа".
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	уатПравилаФормированияУведомлений_уэ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уатПравилаФормированияУведомлений_уэ КАК уатПравилаФормированияУведомлений_уэ
		|ГДЕ
		|	уатПравилаФормированияУведомлений_уэ.ТипСобытия = &ТипСобытия");
		Запрос.УстановитьПараметр("ТипСобытия", Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаРодительскогоЗаказа);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	НовыеЗаписи.Заказ КАК Заказ,
			|	НовыеЗаписи.Статус КАК Статус,
			|	НовыеЗаписи.Период КАК Период
			|ПОМЕСТИТЬ втНовыеЗаписи
			|ИЗ
			|	&НовыеЗаписи КАК НовыеЗаписи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втНовыеЗаписи.Статус КАК ПотенциальныйНовыйСтатус,
			|	уатЗаказГрузоотправителя.РодительскийЗаказ КАК РодительскийЗаказ,
			|	втНовыеЗаписи.Период КАК ДатаУстановкиСтатуса
			|ПОМЕСТИТЬ втРодительскиеЗаказыСоСтатусами
			|ИЗ
			|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНовыеЗаписи КАК втНовыеЗаписи
			|		ПО (втНовыеЗаписи.Заказ = уатЗаказГрузоотправителя.Ссылка)
			|ГДЕ
			|	уатЗаказГрузоотправителя.Мультимодальный = ИСТИНА
			|	И уатЗаказГрузоотправителя.ЭтоЭтап = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	уатЗаказГрузоотправителя.РодительскийЗаказ,
			|	втНовыеЗаписи.Статус,
			|	втНовыеЗаписи.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
			|	уатЭтапыМультимодальныхПеревозок_уэ.Этап КАК Этап
			|ПОМЕСТИТЬ втРодительскиеЗаказыСЭтапами
			|ИЗ
			|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
			|ГДЕ
			|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя В
			|			(ВЫБРАТЬ
			|				втРодительскиеЗаказыСоСтатусами.РодительскийЗаказ
			|			ИЗ
			|				втРодительскиеЗаказыСоСтатусами КАК втРодительскиеЗаказыСоСтатусами)
			|
			|СГРУППИРОВАТЬ ПО
			|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя,
			|	уатЭтапыМультимодальныхПеревозок_уэ.Этап
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втРодительскиеЗаказыСЭтапами.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
			|	ВЫБОР
			|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
			|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
			|	КОНЕЦ КАК СтатусЗаказа
			|ПОМЕСТИТЬ втСтатусыРодительскихЗаказов
			|ИЗ
			|	втРодительскиеЗаказыСЭтапами КАК втРодительскиеЗаказыСЭтапами
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних КАК уатСтатусыГрузов_уэСрезПоследних
			|		ПО (уатСтатусыГрузов_уэСрезПоследних.Заказ = втРодительскиеЗаказыСЭтапами.Этап)
			|
			|СГРУППИРОВАТЬ ПО
			|	втРодительскиеЗаказыСЭтапами.ЗаказГрузоотправителя
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСтатусыРодительскихЗаказов.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
			|	втРодительскиеЗаказыСоСтатусами.ПотенциальныйНовыйСтатус КАК Статус,
			|	втРодительскиеЗаказыСоСтатусами.ДатаУстановкиСтатуса КАК ДатаУстановкиСтатуса
			|ИЗ
			|	втРодительскиеЗаказыСоСтатусами КАК втРодительскиеЗаказыСоСтатусами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтатусыРодительскихЗаказов КАК втСтатусыРодительскихЗаказов
			|		ПО втРодительскиеЗаказыСоСтатусами.ПотенциальныйНовыйСтатус = втСтатусыРодительскихЗаказов.СтатусЗаказа
			|			И втРодительскиеЗаказыСоСтатусами.РодительскийЗаказ = втСтатусыРодительскихЗаказов.ЗаказГрузоотправителя");
			Запрос.УстановитьПараметр("НовыеЗаписи", ДополнительныеСвойства.НовыеЗаписи);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДополнительныеПараметры = Новый Структура("Статус, ДатаУстановкиСтатуса", Выборка.Статус, Выборка.ДатаУстановкиСтатуса);
				уатОбщегоНазначения_уэ.СформироватьУведомление(
					Выборка.ЗаказГрузоотправителя,
					Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаРодительскогоЗаказа,
					ДополнительныеПараметры
				);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьУведомленияПоТекущимЗаписям(ПредыдущиеЗаписи)
	// Старые записи сравниваются с новыми, находятся записи, которых раньше не было, для них формируются уведомления.
	ТекущиеЗаписи = ЭтотОбъект.Выгрузить(,"Заказ, ГрузовоеМесто, Статус, Период, Регистратор");
	НовыеЗаписи = ТекущиеЗаписи.СкопироватьКолонки();
	
	// Не отслеживается изменение времени установки уже установленного статуса - колонки Период
	СтруктураПоиска    = Новый Структура("Заказ, ГрузовоеМесто, Статус"); 
	СоответвиеСтатусов = Новый Соответствие();
	Для Каждого ТекСтрока Из ТекущиеЗаписи Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
		Если ПредыдущиеЗаписи.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НоваяСтрока = НовыеЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;  
		Если ЗначениеЗаполнено(ТекСтрока.ГрузовоеМесто) Тогда
			СтруктураДанных = Новый Структура("ГрузовоеМесто, Статус, Период, Регистратор");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекСтрока);
			МассивСтатусов = СоответвиеСтатусов.Получить(ТекСтрока.Заказ);
			Если МассивСтатусов = Неопределено Тогда 
				МассивСтатусов = Новый Массив();
				МассивСтатусов.Добавить(СтруктураДанных);
				СоответвиеСтатусов.Вставить(ТекСтрока.Заказ, МассивСтатусов);
			Иначе
				МассивСтатусов.Добавить(СтруктураДанных); 
				СоответвиеСтатусов.Вставить(ТекСтрока.Заказ, МассивСтатусов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НовыеЗаписи.Количество() > 0 Тогда
		ДополнительныеСвойства.Вставить("НовыеЗаписи", НовыеЗаписи);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из НовыеЗаписи Цикл
		СформироватьУведомлениеПоЗаписи(ТекСтрока);
	КонецЦикла; 
	
	Если СоответвиеСтатусов.Количество() <> 0 Тогда
		Для Каждого ТекСтрока Из СоответвиеСтатусов Цикл  
			МассивСтатусов = ТекСтрока.Значение; 
			мсвГрузов   = Новый Массив();
			мсвПериодов = Новый СписокЗначений();
			Для Каждого ТекСтатус Из МассивСтатусов Цикл
				Если мсвГрузов.Найти(ТекСтатус.ГрузовоеМесто) = Неопределено Тогда
					мсвГрузов.Добавить(ТекСтатус.ГрузовоеМесто);
				КонецЕсли; 
				
				Если мсвПериодов.НайтиПоЗначению(ТекСтатус.Период) = Неопределено Тогда
					мсвПериодов.Добавить(ТекСтатус.Период);
				КонецЕсли;
			КонецЦикла;
			мсвПериодов.СортироватьПоЗначению();
			// Получим оставшиеся статусы
			СтатусДокумента = Неопределено;
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("Ссылка",       ТекСтрока.Ключ); 
			Запрос.УстановитьПараметр("мсвГрузов",    мсвГрузов);
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	уатСтатусыГрузов_уэСрезПоследних.Заказ КАК Заказ,
			               |	ВЫБОР
			               |		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
			               |			ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
			               |		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
			               |	КОНЕЦ КАК Статус
			               |ИЗ
			               |	РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних(
			               |			,
			               |			НЕ ГрузовоеМесто В (&мсвГрузов)
			               |				И Заказ = &Ссылка) КАК уатСтатусыГрузов_уэСрезПоследних
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	уатСтатусыГрузов_уэСрезПоследних.Заказ";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				СтатусДокумента = Выборка.Статус;
			КонецЕсли;
			
			Если СтатусДокумента <> Справочники.уатСтатусы_уэ.Составной Тогда
				Если ТекСтрока.Ключ.FTL Тогда
					ТекПериод          = Неопределено;
					ТекСтатусДокумента = Неопределено;
					ТекРегистратор     = Неопределено; 
					Для Каждого ТекСтатус Из МассивСтатусов Цикл
						ТекРегистратор = ТекСтатус.Регистратор;
						Если (ЗначениеЗаполнено(ТекСтатусДокумента)
							И ТекСтатус.Статус <> ТекСтатусДокумента)
							ИЛИ (ЗначениеЗаполнено(СтатусДокумента)
							И ТекСтатус.Статус <> СтатусДокумента) Тогда
							ТекСтатусДокумента = Справочники.уатСтатусы_уэ.Составной;
						Иначе
							ТекСтатусДокумента = ТекСтатус.Статус; 
						КонецЕсли;
						ТекПериод = ТекСтатус.Период;
					КонецЦикла; 
					
					СтруктураДанных = Новый Структура("Заказ, ГрузовоеМесто, Статус, Период, Регистратор"); 
					СтруктураДанных.Заказ       = ТекСтрока.Ключ;
					СтруктураДанных.Статус      = ТекСтатусДокумента;
					СтруктураДанных.Период      = ТекПериод;
					СтруктураДанных.Регистратор = ТекРегистратор;
					СформироватьУведомлениеПоЗаписи(СтруктураДанных);
				Иначе
					Для Каждого ТекСтрокаПериод Из мсвПериодов Цикл
						ТекПериод          = ТекСтрокаПериод.Значение;
						ТекСтатусДокумента = Неопределено;
						ТекРегистратор     = Неопределено; 
						Для Каждого ТекСтатус Из МассивСтатусов Цикл
							Если ТекПериод <> ТекСтатус.Период Тогда
								Продолжить;
							КонецЕсли; 
							ТекРегистратор = ТекСтатус.Регистратор;
							Если (ЗначениеЗаполнено(ТекСтатусДокумента)
								И ТекСтатус.Статус <> ТекСтатусДокумента)
								ИЛИ (ЗначениеЗаполнено(СтатусДокумента)
								И ТекСтатус.Статус <> СтатусДокумента) Тогда
								ТекСтатусДокумента = Справочники.уатСтатусы_уэ.Составной;
							Иначе
								ТекСтатусДокумента = ТекСтатус.Статус; 
							КонецЕсли;
						КонецЦикла; 
						
						СтруктураДанных = Новый Структура("Заказ, ГрузовоеМесто, Статус, Период, Регистратор"); 
						СтруктураДанных.Заказ       = ТекСтрока.Ключ;
						СтруктураДанных.Статус      = ТекСтатусДокумента;
						СтруктураДанных.Период      = ТекПериод;
						СтруктураДанных.Регистратор = ТекРегистратор;
						СформироватьУведомлениеПоЗаписи(СтруктураДанных);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
	
Процедура СформироватьУведомлениеПоЗаписи(ТекЗапись)
	
	Если НЕ ЗначениеЗаполнено(ТекЗапись.Заказ) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Статус", ТекЗапись.Статус);
	ДополнительныеПараметры.Вставить("ДатаУстановкиСтатуса", ТекЗапись.Период);
	Если ТипЗнч(ТекЗапись.Регистратор) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		ДополнительныеПараметры.Вставить("ДополнительныйДокумент", ТекЗапись.Регистратор);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекЗапись.ГрузовоеМесто) Тогда
		ДополнительныеПараметры.Вставить("ГрузовоеМесто", ТекЗапись.ГрузовоеМесто);
		ТипСобытия = Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаГрузовогоМеста;
	Иначе
		ТипСобытия = Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатуса;
	КонецЕсли;
	уатОбщегоНазначения_уэ.СформироватьУведомление(
		ТекЗапись.Заказ,
		ТипСобытия,
		ДополнительныеПараметры
	);
КонецПроцедуры

#КонецОбласти
